[
  {
    "id": 1,
    "title": "Sistem informasi",
    "content": "Sistem informasi (SI) adalah sebuah sistem formal, sosioteknis, dan organisasional yang dirancang untuk mengumpulkan, memproses, menyimpan, dan mendistribusikan informasi. Dari perspektif sosioteknis, sistem informasi disusun oleh empat komponen: tugas, orang, struktur (atau peran), dan teknologi. Sistem informasi dapat didefinisikan sebagai suatu integrasi komponen untuk pengumpulan, penyimpanan dan pemrosesan data. Data tersebut kemudian digunakan untuk menyediakan informasi, berkontribusi pada pengetahuan serta produk digital yang memfasilitasi pengambilan keputusan. Sistem informasi komputer adalah sistem yang terdiri dari manusia dan komputer yang memproses atau menafsirkan informasi. Istilah ini juga terkadang digunakan untuk merujuk pada sistem komputer dengan perangkat lunak yang diinstal. Sistem informasi dapat digunakan dalam berbagai konteks, termasuk bisnis, pendidikan, pemerintahan, kesehatan, dan banyak lagi.",
    "url": "https://id.wikipedia.org/wiki/Sistem_informasi"
  },
  {
    "id": 2,
    "title": "Pangkalan data",
    "content": "Pangkalan data atau basis data (bahasa Inggris: database) adalah kumpulan data yang terorganisir, yang umumnya disimpan dan diakses secara elektronik dari suatu sistem komputer. Pada saat pangkalan data menjadi semakin kompleks, maka pangkalan data dikembangkan menggunakan teknik perancangan dan pemodelan secara formal. Perangkat lunak yang digunakan untuk mengelola dan memanggil kueri (query) suatu pangkalan data disebut sistem kelola pangkalan data (database management system, DBMS). Sistem pangkalan data dipelajari dalam ilmu informasi. Istilah \"pangkalan data\" berawal dari ilmu komputer. Meskipun kemudian artinya semakin luas, memasukkan hal-hal di luar bidang elektronika, artikel ini mengenai pangkalan data komputer. Catatan yang mirip dengan pangkalan data sebenarnya sudah ada sebelum revolusi industri yaitu dalam bentuk buku besar, kuitansi dan kumpulan data yang berhubungan dengan bisnis.",
    "url": "https://id.wikipedia.org/wiki/Basis_data"
  },
  {
    "id": 3,
    "title": "Algoritma",
    "content": "Dalam matematika dan ilmu komputer, algoritma adalah rangkaian terbatas dari instruksi-instruksi yang rumit, biasanya digunakan untuk menyelesaikan atau menjalankan suatu kelompok masalah komputasi tertentu. Algoritma digunakan sebagai spesifikasi untuk melakukan perhitungan dan pemrosesan data. Algoritma yang lebih mutakhir dapat melakukan deduksi otomatis (disebut sebagai penalaran otomatis) dan menggunakan tes matematis dan logis untuk mengarahkan eksekusi kode melalui berbagai rute (disebut sebagai pengambilan keputusan otomatis). Penggunaan karakteristik manusia sebagai deskriptor mesin secara metaforis telah dipraktikkan oleh Alan Turing dengan terminologi seperti \"memory\", \"search\" dan \"stimulus\". Sebaliknya, heuristika adalah pendekatan untuk pemecahan masalah komputasi yang mungkin tidak sepenuhnya terspesifikasi atau tidak menjamin hasil yang benar atau optimal, terutama dalam ranah masalah komputasi yang mana tidak ada hasil yang benar atau optimal yang terdefinisi dengan baik. Sebagai metode yang efektif, algoritma dapat diekspresikan dalam jumlah ruang dan waktu yang terbatas, dan dalam bahasa formal yang terdefinisi dengan baik untuk menghitung suatu fungsi. Dimulai dari tataran awal dan input awal (bisa jadi kosong), instruksi-instruksi yang ada menggambarkan sebuah komputasi yang, ketika dieksekusi, berjalan melalui sejumlah tataran dengan jumlah terhingga yang terdefinisi dengan baik, yang pada akhirnya menghasilkan \"output\" dan berakhir pada tataran final akhir. Transisi dari satu tataran ke tataran berikutnya tidak selalu baku; beberapa algoritma, yang dikenal sebagai algoritma acak, menggabungkan input acak.",
    "url": "https://id.wikipedia.org/wiki/Algoritma"
  },
  {
    "id": 4,
    "title": "Kecerdasan buatan",
    "content": "Kecerdasan buatan atau akal imitasi (bahasa Inggris: artificial intelligence, AI) adalah kecerdasan yang ditambahkan kepada suatu sistem yang bisa diatur dalam konteks ilmiah, AI juga didefinisikan sebagai kecerdasan entitas ilmiah. Andreas Kaplan dan Michael Haenlein mendefinisikan kecerdasan buatan sebagai \"kemampuan sistem untuk menafsirkan data eksternal dengan benar, untuk belajar dari data tersebut, dan menggunakan pembelajaran tersebut guna mencapai tujuan dan tugas tertentu melalui adaptasi yang luwes\". Sistem seperti ini umumnya dianggap komputer. Kecerdasan diciptakan dan dimasukkan ke dalam komputer agar dapat melakukan pekerjaan seperti yang dapat dilakukan manusia. Beberapa macam bidang yang menggunakan kecerdasan buatan antara lain sistem pakar, permainan komputer, logika kabur, jejaring saraf tiruan, dan robotika. Secara teknis, kecerdasan buatan adalah model statistik yang digunakan untuk mengambil keputusan dengan menggeneralisir karakteristik dari suatu objek berbasis data yang kemudian dipasang di berbagai perangkat elektronik. Banyak hal yang kelihatannya sulit untuk kecerdasan manusia, tetapi untuk informatika relatif tidak bermasalah. Seperti contoh: mentransformasikan persamaan, menyelesaikan persamaan integral, atau membuat permainan catur. Di sisi lain, hal yang bagi manusia kelihatannya menuntut sedikit kecerdasan, sampai sekarang masih sulit untuk diwujudkan dalam Informatika. Seperti contoh: Pengenalan Objek/Muka, bermain sepak bola. Walaupun AI memiliki konotasi fiksi ilmiah yang kuat, AI membentuk cabang yang sangat penting pada ilmu komputer, berhubungan dengan perilaku, pembelajaran dan adaptasi yang cerdas dalam sebuah mesin. Penelitian dalam AI menyangkut pembuatan mesin dan program komputer untuk mengotomatiskan tugas-tugas yang membutuhkan perilaku cerdas. Termasuk contohnya adalah pengendalian, perencanaan dan penjadwalan, kemampuan untuk menjawab diagnosis dan pertanyaan pelanggan, serta pengenalan tulisan tangan, suara, dan wajah. Hal-hal seperti itu telah menjadi disiplin ilmu tersendiri, yang memusatkan perhatian pada penyediaan solusi masalah kehidupan yang nyata. Sistem AI sekarang ini sering digunakan dalam bidang ekonomi, sains, obat-obatan, teknik, dan militer, seperti yang telah dibangun dalam beberapa penerapan peranti lunak komputer rumah dan video gim (contohnya NPC).",
    "url": "https://id.wikipedia.org/wiki/Kecerdasan_buatan"
  },
  {
    "id": 5,
    "title": "Pemelajaran mesin",
    "content": "Pemelajaran mesin (bahasa Inggris: machine learning atau disingkat dengan ML) adalah sub-bidang kecerdasan buatan yang berkaitan dengan pengembangan dan studi algoritma statistik yang dirancang untuk dapat belajar secara mandiri dari data, kemudian menggunakan pembelajaran tersebut untuk menggeneralisasi dan menangani data baru yang belum pernah ditemui sebelumnya, sehingga sistem ML dapat menjalankan tugas-tugas tertentu tanpa memerlukan instruksi eksplisit yang terprogram sebelumnya. Belakangan, jaringan syaraf tiruan generatif telah menunjukkan performa yang mengungguli berbagai pendekatan konvensional dalam berbagai bidang. Pendekatan pemelajaran mesin telah diimplementasikan di banyak bidang, seperti model bahasa besar (large language model (LLM)), visi komputer, pengenalan ucapan, penyaringan email, agrikultur, dan kedokteran. Bidang-bidang ini membutuhkan kemampuan untuk menangani tugas-tugas kompleks yang sulit dan mahal jika dikembangkan dengan algoritma tradisional. Pemelajaran mesin dikenal dalam aplikasinya dalam menyelesaikan masalah bisnis dengan nama analisis prediktif. Meskipun tidak semua algoritma pemelajaran mesin didasarkan pada statistik, statistik komputasional adalah sumber penting dari metode-metode di bidang ini. Landasan matematis dari pemelajaran mesin diambil dari metode optimisasi matematis (pemrograman matematis). Penggalian data (data mining), bidang studi paralel yang erat kaitannya, berfokus pada analisis data eksploratif melalui pemelajaran tak terarah. Dari perspektif teoretis, kerangka PAC (Probably Approximately Correct) learning memberikan model untuk mendeskripsikan ML.",
    "url": "https://id.wikipedia.org/wiki/Pembelajaran_mesin"
  },
  {
    "id": 6,
    "title": "Jaringan komputer",
    "content": "Jaringan komputer atau jejaring komputer (computer network) adalah jejaring telekomunikasi yang memungkinkan antar komputer untuk saling berkomunikasi dengan bertukar data. Tujuan dari jejaring komputer adalah agar dapat mencapai tujuannya, setiap bagian dari jejaring komputer dapat meminta dan memberikan layanan (service). Pihak yang meminta/menerima layanan disebut kelayan (client) dan yang memberikan/mengirim layanan disebut peladen (server). Desain ini disebut dengan sistem client-server, dan digunakan pada hampir seluruh aplikasi jejaring komputer. Jejaring komputer terbagi menjadi beberapa macam yaitu Local Area Network (LAN), Metropolitan Area Network (MAN), dan Wide Area Network (WAN). Dua buah komputer yang masing-masing memiliki sebuah kartu jejaring, kemudian dihubungkan melalui kabel maupun nirkabel sebagai medium transmisi data, dan terdapat perangkat lunak sistem operasi jejaring akan membentuk sebuah jejaring komputer yang sederhana. Jejaring nirkabel beroperasi menggunakan standar 802.11b/g untuk frekuensi 2,4 GHz, standar 802.11a/ac beroperasi pada frekuensi 5 GHz, dan 802.11n/ax yang beroperasi pada kedua frekuensi. Perbedaan frekuensi 2,4GHz dan 5 GHz terdapat pada kecepatan transmisi data, bandwidth, dan daya cakupan. Pada 2,4GHz memiliki daya cakupan yang lebih jauh dibandingkan dengan 5 GHz, namun 5 GHz memiliki sinyal yang lebih kuat. Apabila ingin membuat jejaring komputer yang lebih luas lagi jangkauannya, maka diperlukan peralatan tambahan seperti hub, bridge, switch, router, gateway sebagai peralatan antarsambungannya. Sejarah jejaring komputer bermula dari lahirnya konsep jejaring komputer pada tahun 1940-an di Amerika yang digagas oleh sebuah proyek pengembangan komputer MODEL I di laboratorium Bell dan group riset Universitas Harvard yang dipimpin profesor Howard Aiken. Pada mulanya proyek tersebut hanyalah ingin memanfaatkan sebuah perangkat komputer yang harus dipakai bersama. Untuk mengerjakan beberapa proses tanpa banyak membuang waktu kosong dibuatlah proses beruntun (Batch Processing), sehingga beberapa program bisa dijalankan dalam sebuah komputer dengan kaidah antrean.",
    "url": "https://id.wikipedia.org/wiki/Jaringan_komputer"
  },
  {
    "id": 7,
    "title": "Keamanan komputer",
    "content": "Keamanan komputer atau keamanan digital (bahasa Inggris: computer security) merupakan keamanan informasi yang terdapat pada komputer atau jaringan. Keamanan komputer juga dikenal dengan sebutan keamanan siber (bahasa Inggris: cybersecurity) atau IT security. Keamanan siber merupakan kumpulan, alat, kebijakan, konsep keamanan, perlindungan keamanan, pedoman, pendekatan manajemen risiko, tindakan, pelatihan, praktik terbaik, jaminan, dan teknologi yang dapat digunakan untuk melindungi lingkungan cyber dan organisasi serta aset pengguna yang disimpan di lingkungan siber. Keamanan komputer bertujuan membantu pengguna agar dapat mencegah penipuan atau mendeteksi adanya usaha penipuan di sebuah sistem yang berbasis informasi. Informasinya sendiri memiliki arti non fisik. Keamanan komputer adalah suatu cabang teknologi yang dikenal dengan nama keamanan informasi yang diterapkan pada komputer. Sasaran keamanan komputer mencakup perlindungan informasi dari pencurian, kerusakan, atau manipulasi, serta pemeliharaan ketersediaan informasi, sebagaimana diuraikan dalam kebijakan keamanan. Sistem keamanan komputer merupakan sebuah upaya yang dilakukan untuk mengamankan kinerja dan proses komputer. Penerapan computer security dalam kehidupan sehari-hari berguna sebagai penjaga sumber daya sistem agar tidak digunakan, modifikasi, interupsi, dan diganggu oleh orang yang tidak berwenang. Keamanan bisa diindentifikasikan dalam masalah teknis, manajerial, legalitas, dan politis.computer security akan membahas 2 hal penting yaitu Ancaman (threats) dan Kelemahan sistem (vulnerabillity). Keamanan komputer memberikan persyaratan terhadap komputer yang berbeda dari kebanyakan persyaratan sistem karena sering kali berbentuk pembatasan terhadap apa yang tidak boleh dilakukan komputer. Ini membuat keamanan komputer menjadi lebih menantang karena sudah cukup sulit untuk membuat program komputer melakukan segala apa yang sudah dirancang untuk dilakukan dengan benar. Persyaratan negatif juga sukar untuk dipenuhi dan membutuhkan pengujian mendalam untuk verifikasinya, yang tidak praktis bagi kebanyakan program komputer. Keamanan komputer memberikan strategi teknis untuk mengubah persyaratan negatif menjadi aturan positif yang dapat ditegakkan.",
    "url": "https://id.wikipedia.org/wiki/Keamanan_komputer"
  },
  {
    "id": 8,
    "title": "Pemrograman",
    "content": "Pemrograman atau penataolahan adalah proses menulis, menguji dan memperbaiki (debug), dan memelihara kode yang membangun suatu program komputer. Kode ini ditulis dalam berbagai bahasa pemrograman. Tujuan dari pemrograman adalah untuk memuat suatu program yang dapat melakukan suatu perhitungan atau 'pekerjaan' sesuai dengan keinginan si pemrogram. Untuk melakukan pemrograman, diperlukan keterampilan dalam algoritme, logika, bahasa pemrograman, dan pada banyak kasus, pengetahuan-pengetahuan lain seperti matematika. Pemrograman adalah suatu seni dalam menggunakan satu atau lebih algoritme yang saling berhubungan dengan menggunakan suatu bahasa pemrograman tertentu sehingga menjadi suatu program komputer. Bahasa pemrograman yang berbeda mendukung gaya pemrograman yang berbeda pula. Gaya pemrograman ini biasa disebut paradigma pemrograman. Apakah memprogram perangkat lunak lebih merupakan seni, ilmu, atau teknik telah lama menjadi bahan perdebatan. Pemrogram yang baik biasanya menggabungkan ketiga hal tersebut, agar dapat menciptakan program yang efisien, baik dari sisi saat dijalankan (run time) atau memori yang digunakan.",
    "url": "https://id.wikipedia.org/wiki/Pemrograman_komputer"
  }
]